# Beginning Data Analysis

In [1]:
import os
os.chdir("../../coding_data/cookbook_data/")
os.getcwd()

"C:\\Users\\k2035549\\OneDrive - King's College London\\Desktop\\Coding\\coding_data\\cookbook_data"

In [2]:
import pandas as pd
import numpy as np

pd.set_option('max_columns', 4, 'max_rows', 10, 'max_colwidth', 12)
pd.set_option('max_columns', None)

## Introduction

## Developing a data analysis routine

### How to do it...

In [3]:
college = pd.read_csv('data/college.csv')
college.sample(random_state=42)

,INSTNM,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,UGDS,UGDS_WHITE,UGDS_BLACK,UGDS_HISP,UGDS_ASIAN,UGDS_AIAN,UGDS_NHPI,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
3649,Career P...,San Antonio,TX,0.0,0.0,0.0,0,NaN,NaN,0.0,529.0,0.3251,0.3119,0.3629,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1,0.9172,0.9172,0.697,20700,14977

In [4]:
college.shape

(7535, 27)

In [5]:
college.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7535 entries, 0 to 7534
Data columns (total 27 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   INSTNM              7535 non-null   object
 1   CITY                7535 non-null   object
 2   STABBR              7535 non-null   object
 3   HBCU                7164 non-null   float64
 4   MENONLY             7164 non-null   float64
 5   WOMENONLY           7164 non-null   float64
 6   RELAFFIL            7535 non-null   int64
 7   SATVRMID            1185 non-null   float64
 8   SATMTMID            1196 non-null   float64
 9   DISTANCEONLY        7164 non-null   float64
 10  UGDS                6874 non-null   float64
 11  UGDS_WHITE          6874 non-null   float64
 12  UGDS_BLACK          6874 non-null   float64
 13  UGDS_HISP           6874 non-null   float64
 14  UGDS_ASIAN          6874 non-null   float64
 15  UGDS_AIAN           6874 non-null   float64
 16  UGDS_NHPI           6874 non-null   float64
 17  UGDS_2MOR           6874 non-null   float64
 18  UGDS_NRA            6874 non-null   float64
 19  UGDS_UNKN           6874 non-null   float64
 20  PPTUG_EF            6853 non-null   float64
 21  CURROPER            7535 non-null   int64
 22  PCTPELL             6849 non-null   float64
 23  PCTFLOAN            6849 non-null   float64
 24  UG25ABV             6718 non-null   float64
 25  MD_EARN_WNE_P10     6413 non-null   object
 26  GRAD_DEBT_MDN_SUPP  7503 non-null   object
dtypes: float64(20), int64(2), object(5)
memory usage: 1.6+ MB

In [6]:
college.describe(include=[np.number]).T

,count,mean,std,min,25%,50%,75%,max
HBCU,7164.0,0.014238,0.118478,0.0,0.0000,0.00000,0.000000,1.0
MENONLY,7164.0,0.009213,0.095546,0.0,0.0000,0.00000,0.000000,1.0
WOMENONLY,7164.0,0.005304,0.072642,0.0,0.0000,0.00000,0.000000,1.0
RELAFFIL,7535.0,0.190975,0.393096,0.0,0.0000,0.00000,0.000000,1.0
SATVRMID,1185.0,522.819409,68.578862,290.0,475.0000,510.00000,555.000000,765.0
...,...,...,...,...,...,...,...,...
PPTUG_EF,6853.0,0.226639,0.246470,0.0,0.0000,0.15040,0.376900,1.0
CURROPER,7535.0,0.923291,0.266146,0.0,1.0000,1.00000,1.000000,1.0
PCTPELL,6849.0,0.530643,0.225544,0.0,0.3578,0.52150,0.712900,1.0
PCTFLOAN,6849.0,0.522211,0.283616,0.0,0.3329,0.58330,0.745000,1.0
UG25ABV,6718.0,0.410021,0.228939,0.0,0.2415,0.40075,0.572275,1.0

In [7]:
college.describe(include=[np.object, pd.Categorical]).T

             count unique          top  freq
INSTNM        7535   7535  Universi...     1
CITY          7535   2514     New York    87
STABBR        7535     59           CA   773
MD_EARN_W...  6413    598  PrivacyS...   822
GRAD_DEBT...  7503   2038  PrivacyS...  1510

### How it works...

### There's more...

In [8]:
college.describe(include=[np.number],
   percentiles=[.01, .05, .10, .25, .5,
                .75, .9, .95, .99]).T

,count,mean,std,min,1%,5%,10%,25%,50%,75%,90%,95%,99%,max
HBCU,7164.0,0.014238,0.118478,0.0,0.000000,0.0000,0.00000,0.0000,0.00000,0.000000,0.00000,0.00000,1.000000,1.0
MENONLY,7164.0,0.009213,0.095546,0.0,0.000000,0.0000,0.00000,0.0000,0.00000,0.000000,0.00000,0.00000,0.000000,1.0
WOMENONLY,7164.0,0.005304,0.072642,0.0,0.000000,0.0000,0.00000,0.0000,0.00000,0.000000,0.00000,0.00000,0.000000,1.0
RELAFFIL,7535.0,0.190975,0.393096,0.0,0.000000,0.0000,0.00000,0.0000,0.00000,0.000000,1.00000,1.00000,1.000000,1.0
SATVRMID,1185.0,522.819409,68.578862,290.0,390.000000,430.0000,447.40000,475.0000,510.00000,555.000000,605.00000,665.00000,730.000000,765.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
PPTUG_EF,6853.0,0.226639,0.246470,0.0,0.000000,0.0000,0.00000,0.0000,0.15040,0.376900,0.60410,0.71062,0.946724,1.0
CURROPER,7535.0,0.923291,0.266146,0.0,0.000000,0.0000,1.00000,1.0000,1.00000,1.000000,1.00000,1.00000,1.000000,1.0
PCTPELL,6849.0,0.530643,0.225544,0.0,0.054976,0.1700,0.23656,0.3578,0.52150,0.712900,0.83330,0.89636,0.993908,1.0
PCTFLOAN,6849.0,0.522211,0.283616,0.0,0.000000,0.0000,0.00000,0.3329,0.58330,0.745000,0.84752,0.89792,0.986368,1.0
UG25ABV,6718.0,0.410021,0.228939,0.0,0.002500,0.0374,0.08990,0.2415,0.40075,0.572275,0.72666,0.80000,0.917383,1.0

## Data dictionaries

In [9]:
pd.read_csv('data/college_data_dictionary.csv')

    column_name  description
0        INSTNM  Institut...
1          CITY  City Loc...
2        STABBR  State Ab...
3          HBCU  Historic...
4       MENONLY  0/1 Men ...
..          ...          ...
22      PCTPELL  Percent ...
23     PCTFLOAN  Percent ...
24      UG25ABV  Percent ...
25  MD_EARN_...  Median E...
26  GRAD_DEB...  Median d...

[27 rows x 2 columns]

## Reducing memory by changing data types

### How to do it...

In [16]:
# choose some columns to see how much memory can be saved
college = pd.read_csv('data/college.csv')

different_cols = ['RELAFFIL', 'SATMTMID', 'CURROPER',
   'INSTNM', 'STABBR']
col2 = college.loc[:, different_cols]
col2.head()

   RELAFFIL  SATMTMID  CURROPER       INSTNM STABBR
0         0     420.0         1  Alabama ...     AL
1         0     565.0         1  Universi...     AL
2         1       NaN         1  Amridge ...     AL
3         0     590.0         1  Universi...     AL
4         0     430.0         1  Alabama ...     AL

In [17]:
col2.dtypes

RELAFFIL      int64
SATMTMID    float64
CURROPER      int64
INSTNM       object
STABBR       object
dtype: object

In [18]:
original_mem = col2.memory_usage(deep=True)
original_mem

Index          128
RELAFFIL     60280
SATMTMID     60280
CURROPER     60280
INSTNM      660240
STABBR      444565
dtype: int64

In [26]:
col2['RELAFFIL'] = col2['RELAFFIL'].astype(np.int8)

In [27]:
col2.dtypes

RELAFFIL        int8
SATMTMID     float64
CURROPER       int64
INSTNM        object
STABBR      category
dtype: object

In [21]:
college[different_cols].memory_usage(deep=True)

Index          128
RELAFFIL     60280
SATMTMID     60280
CURROPER     60280
INSTNM      660240
STABBR      444565
dtype: int64

can try to save memory by changing into categorical columns

In [28]:
col2.select_dtypes(include=['object']).nunique()

INSTNM    7535
dtype: int64

In [29]:
col2['STABBR'] = col2['STABBR'].astype('category')
col2.dtypes

RELAFFIL        int8
SATMTMID     float64
CURROPER       int64
INSTNM        object
STABBR      category
dtype: object

In [30]:
new_mem = col2.memory_usage(deep=True)
new_mem

Index          128
RELAFFIL      7535
SATMTMID     60280
CURROPER     60280
INSTNM      660699
STABBR       13576
dtype: int64

In [25]:
new_mem / original_mem

Index       1.000000
RELAFFIL    0.125000
SATMTMID    1.000000
CURROPER    1.000000
INSTNM      1.000695
STABBR      0.030538
dtype: float64

### How it works...

### There's more...

In [31]:
college.loc[0, 'CURROPER'] = 10000000
college.loc[0, 'INSTNM'] = college.loc[0, 'INSTNM'] + 'a'
college[['CURROPER', 'INSTNM']].memory_usage(deep=True)

Index          128
CURROPER     60280
INSTNM      660752
dtype: int64

In [32]:
college['MENONLY'].dtype

dtype('float64')

In [33]:
college['MENONLY'].astype(np.int8)

ValueError: Cannot convert non-finite values (NA or inf) to integer

In [ ]:
college.assign(MENONLY=college['MENONLY'].astype('float16'),
    RELAFFIL=college['RELAFFIL'].astype('int8'))

In [34]:
college.index = pd.Int64Index(college.index)
college.index.memory_usage() # previously was just 80

60280

## Selecting the smallest of the largest

### How to do it...

In [35]:
movie = pd.read_csv('data/movie.csv')
movie2 = movie[['movie_title', 'imdb_score', 'budget']]
movie2.head()

   movie_title  imdb_score       budget
0       Avatar         7.9  237000000.0
1  Pirates ...         7.1  300000000.0
2      Spectre         6.8  245000000.0
3  The Dark...         8.5  250000000.0
4  Star War...         7.1          NaN

In [36]:
movie2.nlargest(100, 'imdb_score').head()

      movie_title  imdb_score      budget
2725  Towering...         9.5         NaN
1920  The Shaw...         9.3  25000000.0
3402  The Godf...         9.2   6000000.0
2779      Dekalog         9.1         NaN
4312  Kickboxe...         9.1  17000000.0

In [39]:
(movie2
  .nlargest(100, 'imdb_score')
  .nsmallest(5, 'budget')
)

      movie_title  imdb_score    budget
4804  Butterfl...         8.7  180000.0
4801  Children...         8.5  180000.0
4706  12 Angry...         8.9  350000.0
4550  A Separa...         8.4  500000.0
4636  The Othe...         8.4  500000.0

### How it works...

### There's more...

## Selecting the largest of each group by sorting

### How to do it...

In [40]:
movie = pd.read_csv('data/movie.csv')
movie[['movie_title', 'title_year', 'imdb_score']]

      movie_title  title_year  imdb_score
0          Avatar      2009.0         7.9
1     Pirates ...      2007.0         7.1
2         Spectre      2015.0         6.8
3     The Dark...      2012.0         8.5
4     Star War...         NaN         7.1
...           ...         ...         ...
4911  Signed S...      2013.0         7.7
4912  The Foll...         NaN         7.5
4913  A Plague...      2013.0         6.3
4914  Shanghai...      2012.0         6.3
4915  My Date ...      2004.0         6.6

[4916 rows x 3 columns]

In [41]:
(movie
  [['movie_title', 'title_year', 'imdb_score']]
  .sort_values('title_year', ascending=False)
)

      movie_title  title_year  imdb_score
3884     The Veil      2016.0         4.7
2375  My Big F...      2016.0         6.1
2794  Miracles...      2016.0         6.8
92    Independ...      2016.0         5.5
153   Kung Fu ...      2016.0         7.2
...           ...         ...         ...
4683       Heroes         NaN         7.7
4688  Home Movies         NaN         8.2
4704   Revolution         NaN         6.7
4752  Happy Va...         NaN         8.5
4912  The Foll...         NaN         7.5

[4916 rows x 3 columns]

In [42]:
(movie
  [['movie_title', 'title_year', 'imdb_score']]
  .sort_values(['title_year','imdb_score'],
               ascending=False)
)

      movie_title  title_year  imdb_score
4312  Kickboxe...      2016.0         9.1
4277  A Beginn...      2016.0         8.7
3798      Airlift      2016.0         8.5
27    Captain ...      2016.0         8.2
98    Godzilla...      2016.0         8.2
...           ...         ...         ...
1391    Rush Hour         NaN         5.8
4031     Creature         NaN         5.0
2165  Meet the...         NaN         3.5
3246  The Bold...         NaN         3.5
2119  The Bach...         NaN         2.9

[4916 rows x 3 columns]

In [43]:
(movie
  [['movie_title', 'title_year', 'imdb_score']]
  .sort_values(['title_year','imdb_score'],
               ascending=False)
  .drop_duplicates(subset='title_year')
)

      movie_title  title_year  imdb_score
4312  Kickboxe...      2016.0         9.1
3745  Running ...      2015.0         8.6
4369  Queen of...      2014.0         8.7
3935  Batman: ...      2013.0         8.4
3     The Dark...      2012.0         8.5
...           ...         ...         ...
2694   Metropolis      1927.0         8.3
4767  The Big ...      1925.0         8.3
4833  Over the...      1920.0         4.8
4695  Intolera...      1916.0         8.0
2725  Towering...         NaN         9.5

[92 rows x 3 columns]

### How it works...

## There's more...

In [46]:
(movie
  [['movie_title', 'title_year', 'imdb_score']]
  .groupby('title_year', as_index=False)
  .apply(lambda df: df.sort_values('imdb_score',
         ascending=False).head(1))
  .sort_values('title_year', ascending=False)
)

         movie_title  title_year  imdb_score
90 4312  Kickboxe...      2016.0         9.1
89 3745  Running ...      2015.0         8.6
88 4369  Queen of...      2014.0         8.7
87 3935  Batman: ...      2013.0         8.4
86 3     The Dark...      2012.0         8.5
...              ...         ...         ...
4  4555  Pandora'...      1929.0         8.0
3  2694   Metropolis      1927.0         8.3
2  4767  The Big ...      1925.0         8.3
1  4833  Over the...      1920.0         4.8
0  4695  Intolera...      1916.0         8.0

[91 rows x 3 columns]

In [47]:
(movie
  [['movie_title', 'title_year',
    'content_rating', 'budget']]
   .sort_values(['title_year',
       'content_rating', 'budget'],
       ascending=[False, False, True])
   .drop_duplicates(subset=['title_year',
        'content_rating'])
)

      movie_title  title_year content_rating      budget
4026    Compadres      2016.0            R     3000000.0
4658  Fight to...      2016.0        PG-13      150000.0
4661   Rodeo Girl      2016.0           PG      500000.0
3252  The Wailing      2016.0    Not Rated           NaN
4659  Alleluia...      2016.0          NaN      500000.0
...           ...         ...          ...           ...
2558   Lilyhammer         NaN        TV-MA    34000000.0
807   Sabrina,...         NaN         TV-G     3000000.0
848   Stargate...         NaN        TV-14     1400000.0
2436       Carlos         NaN    Not Rated           NaN
2119  The Bach...         NaN          NaN     3000000.0

[359 rows x 4 columns]

## Replicating nlargest with sort_values

### How to do it...

In [48]:
movie = pd.read_csv('data/movie.csv')
(movie
   [['movie_title', 'imdb_score', 'budget']]
   .nlargest(100, 'imdb_score') 
   .nsmallest(5, 'budget')
)

      movie_title  imdb_score    budget
4804  Butterfl...         8.7  180000.0
4801  Children...         8.5  180000.0
4706  12 Angry...         8.9  350000.0
4550  A Separa...         8.4  500000.0
4636  The Othe...         8.4  500000.0

In [49]:
(movie
   [['movie_title', 'imdb_score', 'budget']]
   .sort_values('imdb_score', ascending=False)
   .head(100)
)

      movie_title  imdb_score      budget
2725  Towering...         9.5         NaN
1920  The Shaw...         9.3  25000000.0
3402  The Godf...         9.2   6000000.0
2779      Dekalog         9.1         NaN
4312  Kickboxe...         9.1  17000000.0
...           ...         ...         ...
3799  Anne of ...         8.4         NaN
3777  Requiem ...         8.4   4500000.0
3935  Batman: ...         8.4   3500000.0
4636  The Othe...         8.4    500000.0
2455       Aliens         8.4  18500000.0

[100 rows x 3 columns]

In [50]:
(movie
   [['movie_title', 'imdb_score', 'budget']]
   .sort_values('imdb_score', ascending=False)
   .head(100) 
   .sort_values('budget')
   .head(5)
)

      movie_title  imdb_score    budget
4815  A Charli...         8.4  150000.0
4801  Children...         8.5  180000.0
4804  Butterfl...         8.7  180000.0
4706  12 Angry...         8.9  350000.0
4636  The Othe...         8.4  500000.0

### How it works...

In [51]:
(movie
   [['movie_title', 'imdb_score', 'budget']]
   .nlargest(100, 'imdb_score')
   .tail()
)

      movie_title  imdb_score     budget
4023       Oldboy         8.4  3000000.0
4163  To Kill ...         8.4  2000000.0
4395  Reservoi...         8.4  1200000.0
4550  A Separa...         8.4   500000.0
4636  The Othe...         8.4   500000.0

In [52]:
(movie
   [['movie_title', 'imdb_score', 'budget']]
   .sort_values('imdb_score', ascending=False) 
   .head(100)
   .tail()
)

      movie_title  imdb_score      budget
3799  Anne of ...         8.4         NaN
3777  Requiem ...         8.4   4500000.0
3935  Batman: ...         8.4   3500000.0
4636  The Othe...         8.4    500000.0
2455       Aliens         8.4  18500000.0

## Calculating a trailing stop order price

### How to do it...

In [53]:
import datetime
import pandas_datareader.data as web
import requests_cache
session = requests_cache.CachedSession(
   cache_name='cache', backend='sqlite', 
   expire_after=datetime.timedelta(days=90))

ModuleNotFoundError: No module named 'pandas_datareader'

In [ ]:
tsla = web.DataReader('tsla', data_source='yahoo',
   start='2017-1-1', session=session)
tsla.head(8)

In [ ]:
tsla_close = tsla['Close']

In [ ]:
tsla_cummax = tsla_close.cummax()
tsla_cummax.head()

In [ ]:
(tsla
  ['Close']
  .cummax()
  .mul(.9)
  .head()
)

### How it works...

### There's more...